/**********************************************************************************************************
 * @文件     SafeControl.c
 * @说明     安全保护函数
 * @作者     YuyingJin
 * @网站     https://yuyingjin0111.github.io/
 * @日期     2018 ~
**********************************************************************************************************/
#include "safeControl.h"
/***********************************************************************************************
*函 数 名: Safety_Protection
*功能说明: 侧倾保护
*形    参: 无
*返 回 值: 无
************************************************************************************************/
void Roll_Protection(void){
	Vector3f_angle Attitude = GetCopterAngle();
	//角度大于35度直接关闭浆叶
	if(abs(Attitude.pitch)  > 35.0f || abs(Attitude.roll) > 35.0f){
		pwm_output(0,0,0,0);
	}
}

// /**********************************************************************************************
// *函 数 名: LowPowerProtect
// *功能说明: 低电量/电压保护
// *形    参: 无
// *返 回 值: 无
// ***********************************************************************************************/
// static void LowPowerProtect(void){
// 	//严重低电量时直接降落
// 	if(GetBatteryStatus() == BATTERY_LOW){

// 	}
// }


/**********************************************************************************************
*函 数 名: SafeControl
*功能说明: 安全保护控制
*形    参: 无
*返 回 值: 无
***********************************************************************************************/
void SafeControl(void){
    //侧倾保护
    Roll_Protection();
    // //低电量/电压保护
    // LowPowerProtect();
}

